backend-api/app/controllers/comments_controller.rb

  def create
    comment = Comment.new(comment_params)
    if comment.save
---
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "What? Is this working now?"], ["post_id", 4], ["created_at", "2021-06-15 15:33:27.925030"], ["updated_at", "2021-06-15 15:33:27.925030"]]