backend-api/app/controllers/posts_controller.rb

  def index
    render json: Post.all, include: [comments: {only: [:content]}], except: [:created_at, :updated_at]
---
SELECT "posts".* FROM "posts"

  def create
    post = Post.new(post_params)
    if post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "body") VALUES (?, ?, ?)  [["created_at", "2021-06-08 18:26:28.072500"], ["updated_at", "2021-06-08 18:26:28.072500"], ["body", "asdasdadadasdadasdd"]]

  def update
    post = Post.find_by(id: params[:id])
    post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = ?, "body" = ? WHERE "posts"."id" = ?  [["updated_at", "2021-06-15 15:48:07.493125"], ["body", "Look at whatfdjhgjhgjhgd I am doing here!"], ["id", 1]]

  def destroy
    post = Post.find_by(id: params[:id])
    post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]